#include "States/GameOverState.h"
#include "States/MenuState.h"
#include "Commands/QuitCommand.h"
#include "Commands/ChangeStateCommand.h"

#include <iostream>

void GameOverState::Render() {
    std::cout << "\033[2J\033[H";

    std::cout << "\033[1;31m";

    std::cout << std::endl << std::endl;
    std::cout << "  ░▒▓██████▓▒░ ░▒▓██████▓▒░░▒▓██████████████▓▒░░▒▓████████▓▒░       ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░▒▓███████▓▒░  " << std::endl;
    std::cout << " ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░             ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ " << std::endl;
    std::cout << " ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░             ░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ " << std::endl;
    std::cout << " ░▒▓█▓▒▒▓███▓▒░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓██████▓▒░        ░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒▒▓█▓▒░░▒▓██████▓▒░ ░▒▓███████▓▒░  " << std::endl;
    std::cout << " ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░             ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ " << std::endl;
    std::cout << " ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░             ░▒▓█▓▒░░▒▓█▓▒░ ░▒▓█▓▓█▓▒░ ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░ " << std::endl;
    std::cout << "  ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░       ░▒▓██████▓▒░   ░▒▓██▓▒░  ░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░ " << std::endl;

    std::cout << "\033[0m";


    std::cout << std::endl << std::endl;

    std::cout << "\033[1;33m";
    std::cout << "[m] - Menu" << std::endl;

    std::cout << "\033[1;36m";
    std::cout << "[q] - Quit" << std::endl;

    std::cout << "\033[0m";
}

void GameOverState::Update() {
}

Command* GameOverState::InputHandler(char input) {
    switch (input) {
        case 'm': return new ChangeStateCommand(new MenuState());
        case 'q': return new QuitCommand();
        default:
            return nullptr;
    }
}
